load/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="false" backend="fullstats" version="1.0"> 
  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="2800" />
    <!-- For loadtesting with large number of users, remove this comment
    <client host="tsung-1" maxusers="2800" />
    <client host="tsung-2" maxusers="2800" />
    <client host="tsung-3" maxusers="2800" />
    <client host="tsung-4" maxusers="2800" />
    <client host="tsung-5" maxusers="2800" />
    <client host="tsung-6" maxusers="2800" />
    <client host="tsung-7" maxusers="2800" />
    -->
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="REGION.queues.api.rackspacecloud.com" port="443" type="ssl"></server>
  </servers>
  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default -->
  <monitoring>
    <monitor host="REGION.queues.api.rackspacecloud.com" type="snmp"></monitor>
  </monitoring>
  <load>
    <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>

  <!--arrivalphase phase="2" duration="2" unit="minute">
    <users interarrival="20" unit="second"></users>
  </arrivalphase>

  <arrivalphase phase="3" duration="2" unit="minute">
    <users interarrival="25" unit="second"></users>
  </arrivalphase>

  <arrivalphase phase="4" duration="2" unit="minute">
    <users interarrival="30" unit="second"></users>
  </arrivalphase-->
  </load>
 
 <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
    <option name="ports_range" min="1025" max="65535" />
    <option name="file_server" id='metadata' value="/root/.tsung/queuemetadata.csv"></option>
    <option name="file_server" id='message' value="/root/.tsung/msgbody.csv"></option>
    <option name="file_server" id='claimdata' value="/root/.tsung/claimdata.csv"></option>
    <option name="file_server" id='existingqueue' value="/root/.tsung/existingqueue.csv"></option>
    <option name="file_server" id='auth' value="/root/.tsung/auth.csv"></option>
  </options>
  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->
  <sessions>

    <!--
  Scenario-1 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Get Message
  4. Get Queue Stats
  5. Delete Queue-->
    <session name="Scenario-1" probability="10" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="auth" delimiter=";" order="random">
        <var name="token"/>
        <var name="pid"/>
      </setdynvars>

      <!-- full url with server name, this overrides the "server" config value -->
      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' content_type='application/json' method='GET'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="queue_stats">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/stats' version='1.1' content_type='application/json' method='GET'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
    </session>

    <!--
  Scenario-2 :
  1. Create Queue with random name
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Update Queue metadata (metadata will be random line from queuemetadata.csv)
  4. Get Queue metadata
  5. Delete Queue-->
    <session name="Scenario-2" probability="10" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="auth" delimiter=";" order="random">
        <var name="token"/>
        <var name="pid"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="update_queue_metadata">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata_updated%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_queue_metadata">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
    </session>

  <!--
  Scenario-3 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Claim message
  4. Update Claim from Step 
  5. Delete Claimed messages
  6. Claim message
  7. Get Queue Stats
  8. Delete Queue-->
    <session name="Scenario-3" probability="10" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody_updated" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="auth" delimiter=";" order="random">
        <var name="token"/>
        <var name="pid"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href" />
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n" />
          <http url='/v1/queues/%%_qname%%/claims' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent" />
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9" />
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <!--transaction name="get_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction-->

      <transaction name="update_claim">
        <request subst="true">
          <http url='%%_location%%' version='1.1' contents='%%_claimbody_updated%%' content_type='application/json' method='PATCH'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="get_claim">
        <request subst="true">
          <http url="%%_location%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_claim">
        <request subst="true">
          <http url="%%_location%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
    </session>


  <!--
  Scenario-4 :
  1. Create Queue with random name (metadata will be random line from queuemetadata.csv)
  2. Post Message to the queue (message will be random line from msgbody.csv)
  3. Claim message
  5. Delete Claimed messages
  8. Delete Queue-->
    <session name="Scenario-4" probability="10" type="ts_http">
      <setdynvars sourcetype="random_string" length="12">
        <var name="qname" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="metadata" delimiter=";" order="random">
        <var name="qmetadata" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="auth" delimiter=";" order="random">
        <var name="token"/>
        <var name="pid"/>
      </setdynvars>

      <transaction name="create_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="PUT" version="1.1" contents='%%_qmetadata%%' content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_message">
        <request subst="true">
          <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href" />
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n" />
          <http url='/v1/queues/%%_qname%%/claims' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
      
      <transaction name="delete_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
      
      <transaction name="delete_claim">
        <request subst="true">
          <http url="%%_location%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

<!-- moved delete_message below, since it is not passing claim_id -->
<!--
     <transaction name="delete_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
		</request>
	      </transaction>
    --> 
      <transaction name="delete_queue">
        <request subst="true">
          <http url="/v1/queues/%%_qname%%" method="DELETE" version="1.1">
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>
    </session>


  <!--
  Scenario-5 :
  1. Post 10 Messages to an existing queue - Loop 500 times
  2. Get Messages
  3. Claim messages with limit=5
  4. Delete Claimed messages
  5. Update Queue
  6. Claim messages with limit=1
  7. Delete Claimed messages
  8. Delete Claim  -->
    <session name="Scenario-5" probability="60" type="ts_http">

      <setdynvars sourcetype="file" fileid="existingqueue" delimiter=";" order="random">
        <var name="qname" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="message" delimiter=";" order="random">
        <var name="msgbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="claimdata" delimiter=";" order="random">
        <var name="claimbody" />
      </setdynvars>
      <setdynvars sourcetype="file" fileid="auth" delimiter=";" order="random">
        <var name="token"/>
        <var name="pid"/>
      </setdynvars>


      <transaction name="post_message">
        <for from="1" to="50" incr="1" var="counter">
          <request subst="true">
            <dyn_variable name="location" re="Location: (.*)\r\n" />
            <http url='/v1/queues/%%_qname%%/messages' version='1.1' contents='%%_msgbody%%' content_type='application/json' method='POST'>
              <http_header name="User-Agent" value="Tsung-Agent"/>
              <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
              <http_header name="X-Auth-Token" value="%%_token%%"/>
              <http_header name="X-Project-ID" value="%%_pid%%"/>
            </http>
          </request>
        </for>
      </transaction>

      <transaction name="get_message_by_id">
        <request subst="true">
          <http url="%%_location%%" method="GET" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href" />
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n" />
          <http url='/v1/queues/%%_qname%%/claims?limit=5' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="post_claim">
        <request subst="true">
          <!--Extract href from response body -->
          <dyn_variable name="msgpath" jsonpath="[0].href" />
          <!--Extract location from response header -->
          <dyn_variable name="location" re="Location: (.*)\r\n" />
          <http url='/v1/queues/%%_qname%%/claims?limit=1' version='1.1' contents='%%_claimbody%%' content_type='application/json' method='POST'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_message">
        <request subst="true">
          <http url="%%_msgpath%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

      <transaction name="delete_claim">
        <request subst="true">
          <http url="%%_location%%" method="DELETE" version="1.1" content_type='application/json'>
            <http_header name="User-Agent" value="Tsung-Agent"/>
            <http_header name="Client-ID" value="f02fd805-7945-11e3-abd4-28cfe91478b9"/>
            <http_header name="X-Auth-Token" value="%%_token%%"/>
            <http_header name="X-Project-ID" value="%%_pid%%"/>
          </http>
        </request>
      </transaction>

    </session>
  </sessions>
</tsung>